//Напишите программу, которая принимает на вход 10 целых чисел и выводит на экран:
//● сумму всех чисел;
//● количество чисел, больших 10;
//● количество чисел, меньших -10;
//● среднее арифметическое всех чисел;
//● максимальное и минимальное значения в списке.
//Для решения второго пункта задачи используйте тернарный оператор.

double s = 0;
int greate10 = 0;
int less10 = 0;
int max = int.MinValue;
int min = int.MaxValue;
Console.Write("Введите первое число:");
int x1 = int.Parse(Console.ReadLine());
s += x1;
if (x1 > max) max = x1;
if (x1 < min) min = x1;
Console.Write("Введите второе число:");
int x2 = int.Parse(Console.ReadLine());
s += x2;
if (x2 > max) max = x2;
if (x2 < min) min = x2;
Console.Write("Введите третье число:");
int x3 = int.Parse(Console.ReadLine());
s += x3;
if (x3 > max) max = x3;
if (x3 < min) min = x3;
Console.Write("Введите четвертое число:");
int x4 = int.Parse(Console.ReadLine());
s += x4;
if (x4 > max) max = x4;
if (x4 < min) min = x4;
Console.Write("Введите пятое число:");
int x5 = int.Parse(Console.ReadLine());
s += x5;
if (x5 > max) max = x5;
if (x5 < min) min = x5;
Console.Write("Введите шестое число:");
int x6 = int.Parse(Console.ReadLine());
s += x6;
if (x6 > max) max = x6;
if (x6 < min) min = x6;
Console.Write("Введите седьмое число:");
int x7 = int.Parse(Console.ReadLine());
s += x7;
if (x7 > max) max = x7;
if (x7 < min) min = x7;
Console.Write("Введите восьмое число:");
int x8 = int.Parse(Console.ReadLine());
s += x8;
if (x8 > max) max = x8;
if (x8 < min) min = x8;
Console.Write("Введите девятое число:");
int x9 = int.Parse(Console.ReadLine());
s += x9;
if (x9 > max) max = x9;
if (x9 < min) min = x9;
Console.Write("Введите десятое число:");
int x10 = int.Parse(Console.ReadLine());
s += x10;
if (x10 > max) max = x10;
if (x10 < min) min = x10;
int summ = x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10;
Console.WriteLine($"Сумма всех чисел: {summ}");
Console.WriteLine($"Среднее арифметическое всех чисел: ({(x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10) / 10})");
if (x1 > 10 || x2 > 10 || x3 > 10 || x4 > 10 || x5 > 10) greate10++;
if (x1 < 10 || x2 < 10 || x3 < 10 || x4 < 10 || x5 < 10) less10++;
if (x6 > 10 || x7 > 10 || x8 > 10 || x9 > 10 || x10 > 10) greate10++;
if (x6 < 10 || x7 < 10 || x8 < 10 || x9 < 10 || x10 < 10) less10++;
Console.WriteLine($"Количесво чисел больше 10: {greate10}");
Console.WriteLine($"Количество чисел меньше 10: {less10}");
Console.WriteLine($"Максимальное значение в списке: {max}");
Console.WriteLine($"Минимальное значение в списке: {min}");


