//Напишите программу, где:
//На ввод берется число от пользователя и передается в функцию.
//Функция должна выводить все нечетные числа от 1 до этого числа не
//включительно и делать это рекурсивно

Console.Write("Введите число:");
int n=int.Parse(Console.ReadLine()!);
void Numbers();
{
    int lastNum = 250;
    int defNum = n;
    Console.WriteLine(defNum);
}
