//Домашнее задание. Тема 17. Урок 2. Многомерный массив и массив массивов.
//Создайте массив из трех одномерных массивов. [3][ ]
//Заполните его значениями чисел от 1 до 10 (можно вручную, можно рандомом)
//Далее добавьте вывод всех значений массива. каждый одномерный массив выводится построчно в консоль/ Далее выведите сумму каждого одномерного массива
//*Выведите в конце среднее арифметическое всех значений массива.

Random random = new Random();
int[][] mas = new int[3][];
for (int i = 0; i < 3; i++) ;
{
    for (int j = 0; j < 3; j++) ;
    
}
Console.WriteLine();